lvx/base/Catalogs/бит_ВидыСоответствийАналитик.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>бит_ВидыСоответствийАналитик</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Соотношение</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыСоотношенийАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛеваяАналитика_1</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛеваяАналитика_2</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛеваяАналитика_3</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваяАналитика_1</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваяАналитика_2</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПраваяАналитика_3</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.бит_ВидыДополнительныхАналитик</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрименятьПриПолномСовпаденииТипов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АнализироватьКорреспондирующийСчет</Name>
					<Comment>Анализировать корреспондирующий счет</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

lvx/base/Catalogs/бит_ВидыСоответствийАналитик/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ВерсионированиеОбъектов
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов
	
	// Стандартные действия при создании на сервере.
	бит_РаботаСДиалогамиСервер.ФормаОбъектаПриСозданииНаСервере(Отказ, СтандартнаяОбработка, ЭтотОбъект, Объект);

	Если Отказ Тогда
		Возврат;
	КонецЕсли; 	
	
	Имена = Справочники.бит_ВидыСоответствийАналитик.ЗарезервированныеИмена();
	ЗарезервированныеИмена.Очистить();
	ЗарезервированныеИмена.ЗагрузитьЗначения(Имена.ВыгрузитьЗначения());
	
	// Запрет на редактирования соответствия если уже есть записи для данного вида соответствия.
	Использован 	= Справочники.бит_ВидыСоответствийАналитик.ЕстьЗаписи(Объект.Ссылка) ИЛИ Объект.Предопределенный;
	ЕстьОграничения = Использован ИЛИ Объект.Предопределенный;
	Элементы.Соотношение.ТолькоПросмотр = ЕстьОграничения;
	КоличествоАналитик = Справочники.бит_ВидыСоответствийАналитик.МаксКоличествоАналитик();
	
	Для Н = 1 По КоличествоАналитик Цикл
		Элементы["ЛеваяАналитика_"+Н].ТолькоПросмотр  = ЕстьОграничения;
		Элементы["ПраваяАналитика_"+Н].ТолькоПросмотр = ЕстьОграничения;		
	КонецЦикла; 
	
	Элементы.АнализироватьКорреспондирующийСчет.Видимость = Объект.ПрименятьПриПолномСовпаденииТипов;
	
	Элементы.ГруппаИнформация.Видимость 		  = ЕстьОграничения;
	Элементы.Посмотреть.Видимость				  = ?(Объект.Предопределенный, Ложь, Использован);
    Элементы.ДекорацияНадписьИнформация.Заголовок = ?(Объект.Предопределенный,
                НСтр("ru='Изменение типов аналитик предопределенного вида соответствия невозможно.';
					 |en='Changing the type of analyst predetermined form of the correspondence is not possible.'"),
                НСтр("ru='Изменение типов аналитик невозможно. Вид соответствия уже используется в настройках.';
					 |en='Changing the analyst can not be divided. Kind of compliance is already in use in Settings.'"));
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПрименятьПриПолномСовпаденииТиповПриИзменении(Элемент)
	
	Элементы.АнализироватьКорреспондирующийСчет.Видимость = Объект.ПрименятьПриПолномСовпаденииТипов;
	Если Не Объект.ПрименятьПриПолномСовпаденииТипов Тогда
		Объект.АнализироватьКорреспондирующийСчет = Ложь;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КодПриИзменении(Элемент)
	
	ПроверитьСпецсимволыИмени();
	Если ПустаяСтрока(Объект.Наименование) Тогда
		
		Объект.Наименование = Объект.Код;
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.Код) Тогда
	
		Объект.Код = СтрЗаменить(ТРег(Объект.Наименование)," ","");
	    ПроверитьСпецсимволыИмени();		
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура АналитикаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если АналитикаСоставногоТипа(ВыбранноеЗначение) Тогда		 
		ТекстСообщения = НСтр("ru='Запрещено использовать аналитики с составными типами.';
		  				   |en='It is forbidden to use analytics with composite types.'");
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПосмотретьНажатие(Элемент)
	
	Отбор 		   = Новый Структура("ВидСоответствия", Объект.Ссылка);
	ПараметрыФормы = Новый Структура("Отбор", Отбор); 
	ОткрытьФорму("Документ.бит_НазначениеСоответствияАналитик.ФормаСписка", ПараметрыФормы);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура проверяет спецсимволы в имени вида соответствия. 
// 
&НаКлиенте
Процедура ПроверитьСпецсимволыИмени()
	
	Объект.Код = СтрЗаменить(Объект.Код," ","");
	СпецСимволы = " ,;:[]{}'""/\?!@#$%^&*+=<>~`|()1234567890№-";
	Объект.Код = бит_СтрокиКлиент.ПроверитьСпецСимволы(Объект.Код,СпецСимволы,"Имя");
	
	Если НЕ ЗарезервированныеИмена.НайтиПоЗначению(Объект.Код) = Неопределено Тогда
	
		 ТекстСообщения = НСтр("ru='Имя ""%1"" зарезервировано для фиксированных соответствий.';
		 					   |en='The name ""%1"" is reserved for fixed correspondences.'");
		 ТекстСообщения = СтрШаблон(ТекстСообщения, Объект.Код);
		 ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
		 
		 Объект.Код = "";
	
	КонецЕсли; 
	
КонецПроцедуры

// Процедура проверяет возможность использования выбранной аналитики. 
// 
&НаСервереБезКонтекста
Функция АналитикаСоставногоТипа(Знач Аналитика)
	
	СоставнойТип = Ложь;
	
	Если ЗначениеЗаполнено(Аналитика) Тогда
		 МассивТипов = Аналитика.ТипЗначения.Типы();
		 Если МассивТипов.Количество() > 1 Тогда		 
		 	 СоставнойТип = Истина;
		 КонецЕсли; 
	 КонецЕсли;
	 
	 Возврат СоставнойТип;
	
КонецФункции

#КонецОбласти
